adpyke.codesnap
bradlc.vscode-tailwindcss
christian-kohler.path-intellisense
cweijan.dbclient-jdbc
cweijan.vscode-myssql-client2
daohong-emilio.yash
davidanson.vscode-markdownlint
divyanshuagrawal.competitive-programming-helper
donjayamanne.githistory
dracula-theme.theme-dracula
enkia.tokyo-night
esbenp.prettier-vscode
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
formulahendry.code-runner
franneck94.c-cpp-runner
hars.cppsnippets
luniclynx.lex
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.cpptools
ms-vscode.cpptools-extension-pack
ms-vscode.cpptools-themes
oderwat.indent-rainbow
redhat.java
ritwickdey.liveserver
shd101wyy.markdown-preview-enhanced
streetsidesoftware.code-spell-checker
twxs.cmake
usernamehw.errorlens
vadimcn.vscode-lldb
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vscjava.vscode-gradle
vscjava.vscode-java-debug
vscjava.vscode-java-dependency
vscjava.vscode-java-pack
vscjava.vscode-java-test
vscjava.vscode-maven
vscode-icons-team.vscode-icons
waderyan.gitblame
whizkydee.material-palenight-theme
xaver.clang-format
zhuangtongfa.material-theme
